
const happy_thoughts = [
    {
        "text": "Источник энергии - это когда нашёл своего настоящего врага. Тогда все усилия канализируется и появляется энергия",
        "rating": 15,
        "id": "51b321cd-ae7d-45fc-b371-f06046969b6d",
        "createdAt": 1774542540000,
        "favorite": false
    },
    {
        "text": "Ничего не хочу делать, не понимаю что приносит счастье, занятие программированием шляпа, лежу и кручу мысли",
        "rating": 7,
        "id": "462a8c91-3d11-4689-a088-358b697085db",
        "createdAt": 1774540800000,
        "favorite": false
    },
    {
        "text": "Я не запомню весь материал из курса, слишком много информации, Я никогда не запомню это",
        "rating": 10,
        "id": "efc0a582-38bd-4c8e-a845-a984e4bedd76",
        "createdAt": 1774543800000,
        "favorite": false
    },
    {
        "text": "У искуственного интелекта нет и не будет души. Он никогда не сможет развиться духовно. Поэтому духовное развитие человечества это то что будет в цене",
        "rating": 13,
        "id": "124f7037-8495-4ce2-890a-7c628be79343",
        "createdAt": 1774545000000,
        "favorite": false
    },
    {
        "text": "Я в ёбанном тупике. То что Я изучаю программирование это просто тупик, Я иду уже туда сколько лет и сколько лет понимаю это, а тупик всё быстрее и быстрее ускоряется мне навстречу, пока Я носом на уебусь об стену и не пойму, что дальше пути нет",
        "rating": 9,
        "id": "f7505218-d9c6-4200-96bf-8cc0a23cec17",
        "createdAt": 1774545900000,
        "favorite": false
    },
    {
        "text": "Хотя бы какой то плюс есть от этого программирования, что могу структирировать свой бардак в голове и сделать Себя чуточку осознанее",
        "rating": 11,
        "id": "4304fcc6-0849-4f4a-93e4-e6be7b26097c",
        "createdAt": 1774546320000,
        "favorite": false
    },
    {
        "text": "Я живу в очень сером и бездушном месте в дождливом и холодноим мегаполисе, где нет души. На тёплой природе под солнышком было лучше",
        "rating": 9,
        "id": "a25c0e35-9707-4e32-a5d5-8ef50771af0c",
        "createdAt": 1774546740000,
        "favorite": false
    },
    {
        "text": "Лидеры и кумиры человечества это не нормальные люди. Они не подходят под определние нормальности. Норма - это средний срез текущего порядка человечества. Кто вообще сказал, что нужно быть нормальным? Люди хотят быть нормальными, при этом слушают тех кто вообще далёк от нормы. А среди них все люди нормальные и обычные. Поэтому возникает конфликт. Тот кого Я слушаю говорит одно, но те кто Меня окружают совсем иные и Я такой же. То есть Я какой то неправильный и нужно меняться. Либо не слушать тех, кто рождает такие мысли и оставаться в кругу нормальных, либо начать делать советы, тех кого слушаю и стать уже не нормальным и не обычным, чтобы удовлетворить Свои мысли. А оставаться посередине это худшее из того что может случиться, Ты никогда не узнаешь какого быть не нормальным и никогда при этом не будешь чувствовать Себя обычным, это вечной мучение. Лучшее решение это сделать выбор.",
        "rating": 10,
        "id": "be7fc8ad-b71b-45f2-9714-1776e465829a",
        "createdAt": 1774547100000,
        "favorite": false
    },
    {
        "text": "Быть нормальным это как будто базовая настройка человека. То есть есть ближний социум и Ты стараешься не сильно выделяться среди него. Но может настать момент, когда Ты захочешь большего. И в этот момент рождается конфликт, ведь твоё новое окружение теперь не соответствует Твоим желаниям, но при этом остаётся инстинкт не выделяться из группы. Поэтому, чтобы удовлетворить новые желания нужен новый социум, который будет новой нормой для Тебя, той новой нормой, которая будет удовлетворять Тебя.",
        "rating": 9,
        "id": "5552aee7-0ba1-41c4-8f5f-7e7112367614",
        "createdAt": 1774547400000,
        "favorite": false
    },
    {
        "text": "У меня просто ёбанный страх заработка денег. Я боюсь блять этих бумажек. Как будто Я не заслуживаю их. Хотя они сделают Мою жизнь гораздо свободнее и проще",
        "rating": 7,
        "id": "eb1aac94-d5f3-46df-805e-f2485534cbd9",
        "createdAt": 1774547520000,
        "favorite": false
    },
    {
        "text": "Если и есть что, что отличает меня от успешных людей, так это только Мои внутренние установки. У меня есть ноги, руки, здоровье, молодость, разум, энергия, сила, в общем всё для успеха, НО у меня нет правильных установок. Правильно или нет это вопрос относительный. Но факт остаётся факто, у Меня нет установок, чтобы стать успешным. То есть у меня есть как минимум те (субъективно дестркутивные) установки, которые мешают Мне достичь успеха. И если Я и собрался в Своих влажных мечтах помогать кому то развиваться духовно, то начать нужно с Себя. Попробуй вылечить для начала Себя от своих дерьмо установок, деинсталируй их нахуй и начни уже жить как хочешь!",
        "rating": 13,
        "id": "5b2cd147-81af-4d73-a128-39d5060c7036",
        "createdAt": 1774548000000,
        "favorite": false
    },
    {
        "text": "Если я хочу достичь чего то, то лучший способ это окружить Себя этим. Социум, контент, мысли и тд. Пока у меня нет возможности сделать Себе такой социуем, тогда буду потреблять контент нацеленный на увеличение уверенности в Себе, убирание блока продаж, да и просто увеличения счастья",
        "rating": 14,
        "id": "660d071b-bf23-400c-9a7f-9cf5722bb0d6",
        "createdAt": 1774550820000,
        "favorite": false
    },
    {
        "text": "(После гипнотерапии) Я чувствую себя ахуенно и люблю Себя. Я Создатель Своей реальности и Я хозяин Своих мыслей.",
        "rating": 18,
        "id": "0353c034-3466-4a7b-a939-7bd8c37ad395",
        "createdAt": 1774552620000,
        "favorite": false
    },
    {
        "text": "Это пиздец, всё это время у Меня в голове сидела ёбанная программа на суицид, чтобы Я закончил жизнь ничего не сделав под мостом бомжом. Блять она монополист в моей голове, нужен срочный геноцид этого говна",
        "rating": 15,
        "id": "debcadcf-ea5f-45ad-ae21-763b684611b7",
        "createdAt": 1774553520000,
        "favorite": false
    },
    {
        "text": "(После аффирмаций и прогулки) Я всё могу. У меня есть силы. Я хочу взращивать в Себе новую программу, точнее восстанавливать Свою изначальную Божественную программу. Я хочу действовать и менять этот Мир.",
        "rating": 19,
        "id": "43222f2a-b73a-4888-af10-26439d448c52",
        "createdAt": 1774558740000
    }
]

const happy_entries = [
    {
        "date": "2026-03-21",
        "hour": 1,
        "rating": 3,
        "comment": "Сидел залипал в ютубе",
        "category": "0f4a0c21-45a2-4cdd-8501-c1a46b583221",
        "id": "3833f0f1-e9d3-4735-952d-4cfe82a0b5e5",
        "createdAt": 1774054080525,
        "minute": 0
    },
    {
        "date": "2026-03-21",
        "hour": 2,
        "rating": 1,
        "comment": "Сидел, долго думал почему ничего не хочу делать, почему так много невротизирую свои действия",
        "category": "72e9023b-6f4b-425d-bb9f-8264b409192f",
        "id": "43e2db8c-0079-4fed-a708-287730843562",
        "createdAt": 1774054160673,
        "minute": 0
    },
    {
        "date": "2026-03-21",
        "hour": 3,
        "rating": 6,
        "comment": "Понял что можно отслеживать своё состояние, что это хорошая мотивация для действий и хорошая практика для самоосознания",
        "category": "f0c6c5e2-ab2e-48f4-8594-ce159a1fb4a5",
        "id": "65bfb553-8ba9-4dd2-9a1b-1d59c557fc58",
        "createdAt": 1774054397039,
        "minute": 0
    },
    {
        "date": "2026-03-21",
        "hour": 4,
        "minute": 0,
        "rating": 5,
        "comment": "Прошёл пару тем из ts",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "fad8bfca-b5d8-48a6-ba08-22c3f1af948d",
        "createdAt": 1774055471551
    },
    {
        "date": "2026-03-21",
        "hour": 9,
        "minute": 30,
        "rating": 4,
        "comment": "Поспал где то 4-5 часов",
        "category": "sleep",
        "id": "3e058b51-da53-457a-925d-42fea559c59f",
        "createdAt": 1774075105171
    },
    {
        "date": "2026-03-21",
        "hour": 10,
        "minute": 0,
        "rating": 4,
        "comment": "Прошёл одну тему по тс",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "a16e0d1d-5ca4-4060-99d0-cf185a500260",
        "createdAt": 1774075812474
    },
    {
        "date": "2026-03-21",
        "hour": 10,
        "minute": 30,
        "rating": 6,
        "comment": "Смотрел ютуб и ел",
        "category": "0f4a0c21-45a2-4cdd-8501-c1a46b583221",
        "id": "9f2ebff9-ce44-458c-ac65-4109ed4151df",
        "createdAt": 1774080231679
    },
    {
        "date": "2026-03-21",
        "hour": 11,
        "minute": 0,
        "rating": 5,
        "comment": "смотрел ютуб",
        "category": "0f4a0c21-45a2-4cdd-8501-c1a46b583221",
        "id": "51a8666b-ed40-46b5-9e02-2746628e9510",
        "createdAt": 1774080253777
    },
    {
        "date": "2026-03-21",
        "hour": 11,
        "minute": 20,
        "rating": 8,
        "comment": "Стойка на кулаках 4 минуты + мысле формы сразу после + задувка и боевой настрой",
        "category": "8eb71df1-a0c8-40cf-b20e-cb67e6c52aaf",
        "id": "97f109e9-9aba-4ebe-b98b-99aee80b2506",
        "createdAt": 1774081506369
    },
    {
        "date": "2026-03-21",
        "hour": 11,
        "minute": 50,
        "rating": 7,
        "comment": "Прошёл 3 темы по тс (остатки настроение от ТР)",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "fd2091af-3510-408a-9ba8-b8da6beb11e1",
        "createdAt": 1774083042833
    },
    {
        "date": "2026-03-21",
        "hour": 12,
        "minute": 30,
        "rating": 5,
        "comment": "",
        "category": "sleep",
        "id": "b777ab03-4db5-4c79-85b8-adf666d39a30",
        "createdAt": 1774087994717
    },
    {
        "date": "2026-03-21",
        "hour": 13,
        "minute": 0,
        "rating": 6,
        "comment": "",
        "category": "sleep",
        "id": "cef7df80-763c-47bd-909a-de3f70eaad95",
        "createdAt": 1774088004128
    },
    {
        "date": "2026-03-21",
        "hour": 13,
        "minute": 30,
        "rating": 7,
        "comment": "помылся",
        "category": "ac6e4a0d-176b-4634-b4a0-c33080b02065",
        "id": "2998e1f4-7886-416b-ae17-73f1afbabbb8",
        "createdAt": 1774089654828
    },
    {
        "date": "2026-03-21",
        "hour": 14,
        "minute": 0,
        "rating": 8,
        "comment": "ёбнул стак адаптогенов как завещал дядюшка Макарон",
        "category": "supplements",
        "id": "64b8758c-733f-41ac-a199-5b5194df051f",
        "createdAt": 1774090784528
    },
    {
        "date": "2026-03-21",
        "hour": 15,
        "minute": 0,
        "rating": 8,
        "comment": "подготовка к тренировке",
        "category": "sport",
        "id": "33f7cf14-d1ec-4676-ae17-8b6bc3df79f3",
        "createdAt": 1774103475355
    },
    {
        "date": "2026-03-21",
        "hour": 16,
        "minute": 30,
        "rating": 7,
        "comment": "тренировка",
        "category": "sport",
        "id": "3276577a-99a9-42fc-a909-2d59b36261b8",
        "createdAt": 1774103508738
    },
    {
        "date": "2026-03-21",
        "hour": 17,
        "minute": 0,
        "rating": 9,
        "comment": "эйфория после тренировки",
        "category": "sport",
        "id": "c69e98cd-739d-44be-9ca0-488c41ceec3c",
        "createdAt": 1774103529471
    },
    {
        "date": "2026-03-21",
        "hour": 18,
        "minute": 0,
        "rating": 7,
        "comment": "прошёл пару тем по тс",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "b8e02760-6a87-4dd0-8ef1-e7d031cca7b0",
        "createdAt": 1774106688848
    },
    {
        "date": "2026-03-21",
        "hour": 18,
        "minute": 30,
        "rating": 6,
        "comment": "",
        "category": "food",
        "id": "38ba24e7-7c23-4ee4-bccf-b26a1aebcb7c",
        "createdAt": 1774111999312
    },
    {
        "date": "2026-03-21",
        "hour": 20,
        "minute": 0,
        "rating": 6,
        "comment": "",
        "category": "sleep",
        "id": "221869c7-47a0-427d-b2b8-a2afdf65b138",
        "createdAt": 1774112023744
    },
    {
        "date": "2026-03-21",
        "hour": 20,
        "minute": 30,
        "rating": 7,
        "comment": "Появилось чувство понимания и лёгкое чувство радости",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "94a0fc88-8359-4cb8-99b2-edac133a4b00",
        "createdAt": 1774114093208
    },
    {
        "date": "2026-03-21",
        "hour": 21,
        "minute": 0,
        "rating": 5,
        "comment": "",
        "category": "0f4a0c21-45a2-4cdd-8501-c1a46b583221",
        "id": "bdcc98a2-3844-4c27-b096-80debc91e048",
        "createdAt": 1774117043100
    },
    {
        "date": "2026-03-21",
        "hour": 22,
        "minute": 0,
        "rating": 6,
        "comment": "",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "d91a2fd4-87dd-4ee8-bb92-98d8047edd15",
        "createdAt": 1774121413435
    },
    {
        "date": "2026-03-21",
        "hour": 22,
        "minute": 30,
        "rating": 8,
        "comment": "Рапэ + мыслеформы + счастье",
        "category": "20af4a1e-441c-4e21-944c-3f05dec5d0c9",
        "id": "4440f480-0574-454e-8d65-1c9a0518e045",
        "createdAt": 1774121490768
    },
    {
        "date": "2026-03-21",
        "hour": 23,
        "minute": 0,
        "rating": 7,
        "comment": "",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "d7431668-6863-4178-9432-de9bb78abd22",
        "createdAt": 1774128739087
    },
    {
        "date": "2026-03-21",
        "hour": 23,
        "minute": 30,
        "rating": 5,
        "comment": "",
        "category": "0f4a0c21-45a2-4cdd-8501-c1a46b583221",
        "id": "d862daae-32a2-4644-9cc3-c73608b7651e",
        "createdAt": 1774128773634
    },
    {
        "date": "2026-03-21",
        "hour": 23,
        "minute": 59,
        "rating": 6,
        "comment": "",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "8ab68b5a-e310-40c0-bcdf-a52ddedfb4d2",
        "createdAt": 1774128805184
    },
    {
        "date": "2026-03-21",
        "hour": 0,
        "minute": 0,
        "rating": 3,
        "comment": "",
        "category": "0f4a0c21-45a2-4cdd-8501-c1a46b583221",
        "id": "f3c961e7-5e4e-4b43-adfa-ce3663b7c4d5",
        "createdAt": 1774128831800
    },
    {
        "date": "2026-03-22",
        "hour": 0,
        "minute": 0,
        "rating": 5,
        "comment": "",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "4ca039f8-6b57-4a39-8854-c98fb25bba4d",
        "createdAt": 1774131901226
    },
    {
        "date": "2026-03-22",
        "hour": 1,
        "minute": 30,
        "rating": 5,
        "comment": "",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "029f691e-4d12-45bd-9a9d-6c49b1529396",
        "createdAt": 1774131914376
    },
    {
        "date": "2026-03-22",
        "hour": 2,
        "minute": 40,
        "rating": 2,
        "comment": "",
        "category": "0f4a0c21-45a2-4cdd-8501-c1a46b583221",
        "id": "f67976f2-ced7-4934-b729-3089ccd78b62",
        "createdAt": 1774136978944
    },
    {
        "date": "2026-03-22",
        "hour": 3,
        "minute": 30,
        "rating": 5,
        "comment": "накидал материала по легенде",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "048feab3-f0ee-441d-b323-9f8e7e3badde",
        "createdAt": 1774139699287
    },
    {
        "date": "2026-03-22",
        "hour": 8,
        "minute": 30,
        "rating": 3,
        "comment": "",
        "category": "sleep",
        "id": "20a6cd24-c4a4-44ee-a4a1-53d02fac69ae",
        "createdAt": 1774164070324
    },
    {
        "date": "2026-03-22",
        "hour": 9,
        "minute": 30,
        "rating": 4,
        "comment": "",
        "category": "sleep",
        "id": "a2aff87f-d031-4e02-b538-bce8cd633e03",
        "createdAt": 1774164089273
    },
    {
        "date": "2026-03-22",
        "hour": 10,
        "minute": 20,
        "rating": 5,
        "comment": "",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "89b557df-2a81-4746-b8c5-b4e290335e86",
        "createdAt": 1774164100274
    },
    {
        "date": "2026-03-22",
        "hour": 10,
        "minute": 40,
        "rating": 8,
        "comment": "Зарядка + адаптогены",
        "category": "8eb71df1-a0c8-40cf-b20e-cb67e6c52aaf",
        "id": "60360cb0-309b-4ae3-9797-b9ad2d039478",
        "createdAt": 1774165058064
    },
    {
        "date": "2026-03-22",
        "hour": 12,
        "minute": 0,
        "rating": 7,
        "comment": "",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "a5a94245-ad0d-4061-862f-5b938aa18edf",
        "createdAt": 1774193489508
    },
    {
        "date": "2026-03-22",
        "hour": 13,
        "minute": 0,
        "rating": 7,
        "comment": "Предвкушение перед тренировкой",
        "category": "sport",
        "id": "58d8fb2e-4340-43ca-8c91-e08856ab0578",
        "createdAt": 1774193517715
    },
    {
        "date": "2026-03-22",
        "hour": 13,
        "minute": 30,
        "rating": 6,
        "comment": "Начало",
        "category": "sport",
        "id": "ebbc6784-8595-452b-9304-351a6923ce63",
        "createdAt": 1774193560421
    },
    {
        "date": "2026-03-22",
        "hour": 15,
        "minute": 0,
        "rating": 7,
        "comment": "Тренировка открытый ковёр на экополиск",
        "category": "sport",
        "id": "8adeabf9-3369-4527-91f2-b8c6f1268069",
        "createdAt": 1774193595454
    },
    {
        "date": "2026-03-22",
        "hour": 16,
        "minute": 0,
        "rating": 7,
        "comment": "Дорога домой на эйфории + ТР",
        "category": "sport",
        "id": "94df8c98-7edf-46aa-8b1b-9bcb73a951c8",
        "createdAt": 1774193631020
    },
    {
        "date": "2026-03-22",
        "hour": 16,
        "minute": 30,
        "rating": 6,
        "comment": "+ небольшой просмотр ютуба",
        "category": "food",
        "id": "25247613-1027-41bd-85c9-d7f8b63b7423",
        "createdAt": 1774193674823
    },
    {
        "date": "2026-03-22",
        "hour": 18,
        "minute": 0,
        "rating": 3,
        "comment": "проснулся разбитый, всё болит",
        "category": "sleep",
        "id": "71b631e9-46da-42b5-b882-e6914bfb62ac",
        "createdAt": 1774193722654
    },
    {
        "date": "2026-03-22",
        "hour": 18,
        "minute": 30,
        "rating": 6,
        "comment": "Встал, правильно настроился, немного потянулся и сильно полегчало",
        "category": "20af4a1e-441c-4e21-944c-3f05dec5d0c9",
        "id": "9cde0724-88c9-495d-bdb9-3121189952af",
        "createdAt": 1774193806819
    },
    {
        "date": "2026-03-22",
        "hour": 19,
        "minute": 30,
        "rating": 8,
        "comment": "ахуенный настрой",
        "category": "walk",
        "id": "acd149a6-d2d9-4c0d-ab59-bb5c5d0068a9",
        "createdAt": 1774202797444
    },
    {
        "date": "2026-03-22",
        "hour": 21,
        "minute": 0,
        "rating": 7,
        "comment": "Понял много вещей касательно счастья",
        "category": "20af4a1e-441c-4e21-944c-3f05dec5d0c9",
        "id": "7acba610-d5e5-4654-8a0f-2110d8c7c285",
        "createdAt": 1774202850191
    },
    {
        "date": "2026-03-22",
        "hour": 21,
        "minute": 50,
        "rating": 8,
        "comment": "Кайфово позанимался легендой после зарядки",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "f907b1fb-e6b2-4e6a-bfeb-40aa380e549e",
        "createdAt": 1774205291475
    },
    {
        "date": "2026-03-22",
        "hour": 23,
        "minute": 0,
        "rating": 7,
        "comment": "Поел + дозировано посмотрел ютуб, затем почитал",
        "category": "reading",
        "id": "78a80dac-b0db-4edd-b85c-6bb844bd93bb",
        "createdAt": 1774209323953
    },
    {
        "date": "2026-03-22",
        "hour": 23,
        "minute": 59,
        "rating": 7,
        "comment": "Помыл машину",
        "category": "ac6e4a0d-176b-4634-b4a0-c33080b02065",
        "id": "14e51a7a-f4fc-4822-9ed6-607daf30b008",
        "createdAt": 1774218568248
    },
    {
        "date": "2026-03-23",
        "hour": 1,
        "minute": 30,
        "rating": 7,
        "comment": "Думал про жизнь, пришёл к решению",
        "category": "20af4a1e-441c-4e21-944c-3f05dec5d0c9",
        "id": "97de3147-4b51-4e55-bbf1-de13ee40941c",
        "createdAt": 1774218598362
    },
    {
        "date": "2026-03-23",
        "hour": 0,
        "minute": 0,
        "rating": 6,
        "comment": "Думал, но не мог прийти к решению",
        "category": "20af4a1e-441c-4e21-944c-3f05dec5d0c9",
        "id": "915b8a23-e1c1-4e1d-a201-4e81fe66b5cf",
        "createdAt": 1774218623413
    },
    {
        "date": "2026-03-23",
        "hour": 10,
        "minute": 30,
        "rating": 6,
        "comment": "",
        "category": "sleep",
        "id": "0694a1ac-eef2-4fe1-8ccd-4295cd121c24",
        "createdAt": 1774252453453
    },
    {
        "date": "2026-03-23",
        "hour": 11,
        "minute": 0,
        "rating": 7,
        "comment": "",
        "category": "reading",
        "id": "557588ea-9a95-45dc-87e5-0530b93ed01d",
        "createdAt": 1774252467484
    },
    {
        "date": "2026-03-23",
        "hour": 11,
        "minute": 30,
        "rating": 8,
        "comment": "Адаптогенчики + зарядка",
        "category": "supplements",
        "id": "d72fc59b-40e2-4ad5-81aa-c72fccabe527",
        "createdAt": 1774255123391
    },
    {
        "date": "2026-03-23",
        "hour": 12,
        "minute": 0,
        "rating": 7,
        "comment": "",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "d0e3310d-f1cf-4b56-9439-82d2599e6030",
        "createdAt": 1774256742970
    },
    {
        "date": "2026-03-23",
        "hour": 12,
        "minute": 30,
        "rating": 6,
        "comment": "",
        "category": "food",
        "id": "9bbea438-5ff5-48fb-8650-c0891119dc66",
        "createdAt": 1774263465239
    },
    {
        "date": "2026-03-23",
        "hour": 14,
        "minute": 0,
        "rating": 8,
        "comment": "",
        "category": "walk",
        "id": "4df70c8a-e625-4932-88ed-29cc9a7a9e42",
        "createdAt": 1774263481151
    },
    {
        "date": "2026-03-23",
        "hour": 15,
        "minute": 0,
        "rating": 6,
        "comment": "",
        "category": "sleep",
        "id": "b2253a41-87ec-4ea6-a690-2f9bfc22aa78",
        "createdAt": 1774271081724
    },
    {
        "date": "2026-03-23",
        "hour": 16,
        "minute": 0,
        "rating": 7,
        "comment": "",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "9bc0ee44-e251-4e36-8b16-b4b03df9b3d2",
        "createdAt": 1774271099906
    },
    {
        "date": "2026-03-23",
        "hour": 16,
        "minute": 30,
        "rating": 8,
        "comment": "",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "11208b34-2c98-400f-b123-24ad97e64b74",
        "createdAt": 1774282920609
    },
    {
        "date": "2026-03-23",
        "hour": 18,
        "minute": 0,
        "rating": 7,
        "comment": "Согласился на помощь, которая по итогу даже была не нужна, просто потратил полтора часа времени, надо более уважительно относиться к Себе",
        "category": "72e9023b-6f4b-425d-bb9f-8264b409192f",
        "id": "cc7a6c2e-2aa1-4ce0-8a77-c207d6720f5a",
        "createdAt": 1774283026491
    },
    {
        "date": "2026-03-23",
        "hour": 18,
        "minute": 30,
        "rating": 7,
        "comment": "",
        "category": "food",
        "id": "0264c04a-d6b8-473c-bdb4-d862a090c00c",
        "createdAt": 1774283043439
    },
    {
        "date": "2026-03-23",
        "hour": 19,
        "minute": 20,
        "rating": 8,
        "comment": "Поймал волну обучения",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "66b6f62a-c807-4fe6-b152-810865218ff3",
        "createdAt": 1774283055908
    },
    {
        "date": "2026-03-23",
        "hour": 20,
        "minute": 0,
        "rating": 9,
        "comment": "Поймал волну счастья",
        "category": "sport",
        "id": "b4ed99cc-62cf-4fa3-afb2-1344beb709f0",
        "createdAt": 1774305462039
    },
    {
        "date": "2026-03-23",
        "hour": 22,
        "minute": 0,
        "rating": 8,
        "comment": "кайфово отзанимался",
        "category": "sport",
        "id": "1958e269-d3c3-4edf-93a7-394df49d7fef",
        "createdAt": 1774305486889
    },
    {
        "date": "2026-03-23",
        "hour": 22,
        "minute": 30,
        "rating": 8,
        "comment": "Сегодня даже еда не прогнула",
        "category": "food",
        "id": "2f372ac0-0fa9-4a56-831e-96cc40742a84",
        "createdAt": 1774305517488
    },
    {
        "date": "2026-03-23",
        "hour": 23,
        "minute": 30,
        "rating": 9,
        "comment": "Хуярил легенду + хх на энтузиазме",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "61166da7-4f60-4d39-9997-c0b5fe4a33ca",
        "createdAt": 1774305562271
    },
    {
        "date": "2026-03-23",
        "hour": 23,
        "minute": 59,
        "rating": 9,
        "comment": "",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "455d49ff-2965-44fe-aada-bf24d6c192b1",
        "createdAt": 1774305575304
    },
    {
        "date": "2026-03-24",
        "hour": 0,
        "minute": 0,
        "rating": 9,
        "comment": "День начался отлично с изучение проги",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "4e38e28f-41b8-4c4b-ae32-20979aca51d4",
        "createdAt": 1774305604939
    },
    {
        "date": "2026-03-24",
        "hour": 1,
        "minute": 40,
        "rating": 9,
        "comment": "кайфово поизуал и порешал задачки",
        "category": "395714e6-66a9-481d-9889-5bebcf5e749e",
        "id": "f138cdc9-42df-4abe-a8f0-737cae5924e3",
        "createdAt": 1774305624320
    }
]

const happy_categories = [
    {
        "id": "sport",
        "name": "Спорт",
        "color": "#22c55e"
    },
    {
        "id": "supplements",
        "name": "БАДы",
        "color": "#eab308"
    },
    {
        "id": "reading",
        "name": "Чтение",
        "color": "#3b82f6"
    },
    {
        "id": "walk",
        "name": "Прогулка",
        "color": "#06b6d4"
    },
    {
        "id": "work",
        "name": "Работа",
        "color": "#f97316"
    },
    {
        "id": "sleep",
        "name": "Сон",
        "color": "#6366f1"
    },
    {
        "id": "food",
        "name": "Еда",
        "color": "#ec4899"
    },
    {
        "name": "Лёгкий дофамин",
        "id": "0f4a0c21-45a2-4cdd-8501-c1a46b583221",
        "color": "#5c5c5c"
    },
    {
        "name": "Мыслекрут",
        "id": "72e9023b-6f4b-425d-bb9f-8264b409192f",
        "color": "#3b82f6"
    },
    {
        "name": "Тестирование новых гипотез",
        "id": "f0c6c5e2-ab2e-48f4-8594-ce159a1fb4a5",
        "color": "#8b5cf6"
    },
    {
        "name": "Обучение",
        "color": "#f97316",
        "id": "395714e6-66a9-481d-9889-5bebcf5e749e"
    },
    {
        "name": "Тестостерон релиз",
        "color": "#ff0000",
        "id": "8eb71df1-a0c8-40cf-b20e-cb67e6c52aaf"
    },
    {
        "name": "Уборка/гигиена",
        "color": "#00e1ff",
        "id": "ac6e4a0d-176b-4634-b4a0-c33080b02065"
    },
    {
        "name": "Осознанность",
        "color": "#be5cff",
        "id": "20af4a1e-441c-4e21-944c-3f05dec5d0c9"
    }
]

export { happy_thoughts, happy_entries, happy_categories }